InformationRegisters/СоответствиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодставляемаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеНоменклатуры/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	
	СтруктураНоменклатур = ПроверитьЗаполнениеНоменклатуры();
	
	Если СтруктураНоменклатур.НетОшибок Тогда
		
		Номенклатура = СтруктураНоменклатур.Номенклатура;
		СтруктураНоменклатур.Удалить("Номенклатура");
		СтруктураНоменклатур.Удалить("НетОшибок");
		ЗаписатьНаСервере(Номенклатура, СтруктураНоменклатур);
		Модифицированность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере(Номенклатура, СтруктураНоменклатур)
	
	Для Каждого Элемент Из СтруктураНоменклатур Цикл
		
		ПодставляемаяНоменклатура = Элемент.Значение;
		НоменклатурнаяГруппа = ПодставляемаяНоменклатура.НоменклатурнаяГруппа;
		НаборЗаписей = РегистрыСведений.СоответствиеНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Отбор.НоменклатурнаяГруппа.Установить(НоменклатурнаяГруппа);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
		Иначе
			
			//НаборЗаписей.Прочитать();
			НоваяЗапись = НаборЗаписей[0];
		
		КонецЕсли;
		
		
		НоваяЗапись.ПодставляемаяНоменклатура = ПодставляемаяНоменклатура;
		НоваяЗапись.Номенклатура = Номенклатура;
		НоваяЗапись.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
		
		НаборЗаписей.Записать();
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция  ПроверитьЗаполнениеНоменклатуры()
	
	СтруктураНоменклатурДляПроверки = Новый Структура;
	СтруктураНоменклатурДляПроверки.Вставить("Номенклатура", Запись.Номенклатура);
	СтруктураНоменклатурДляПроверки.Вставить("ЗаглушкаПодЕвровинт", ЗаглушкаПодЕвровинт);
	СтруктураНоменклатурДляПроверки.Вставить("ЗаглушкаПодЭксцентриковуюСтяжку", ЗаглушкаПодЭксцентриковуюСтяжку);
	СтруктураНоменклатурДляПроверки.Вставить("Кромка045х19мм", Кромка045х19мм);
	СтруктураНоменклатурДляПроверки.Вставить("Кромка2х19мм", Кромка2х19мм);
	СтруктураНоменклатурДляПроверки.Вставить("Кромка2х35мм", Кромка2х35мм);
	СтруктураНоменклатурДляПроверки.Вставить("МонтажныйУголок", МонтажныйУголок);
	СтруктураНоменклатурДляПроверки.Вставить("НетОшибок", Истина);
	
	Ошибки = Неопределено;
	
	Для каждого Элемент Из СтруктураНоменклатурДляПроверки Цикл
	
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
		
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "" + Элемент.Ключ, "Не заполнен элемент " + Элемент.Ключ);
			СтруктураНоменклатурДляПроверки.Вставить("НетОшибок", Ложь);
			
		КонецЕсли; 
	
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Ложь);
	
	Возврат СтруктураНоменклатурДляПроверки;
	
КонецФункции // ПроверитьЗаполнение()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Запись.Номенклатура;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
	
		НаборЗаписей = РегистрыСведений.СоответствиеНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			
			Для каждого ЭлементЗаписи Из НаборЗаписей Цикл
				
				НоменклатурнаяГруппа = ЭлементЗаписи.НоменклатурнаяГруппа;
				СправочникНоменклатурныеГруппы = Справочники.НоменклатурныеГруппы;
				
				Если НоменклатурнаяГруппа = СправочникНоменклатурныеГруппы.ЗаглушкаПоЕвровинт Тогда
				
					ЗаглушкаПодЕвровинт = ЭлементЗаписи.ПодставляемаяНоменклатура;
				
				ИначеЕсли НоменклатурнаяГруппа = СправочникНоменклатурныеГруппы.ЗаглушкаПодЭксцСтяжку Тогда
				
					ЗаглушкаПодЭксцентриковуюСтяжку = ЭлементЗаписи.ПодставляемаяНоменклатура;
					
				ИначеЕсли НоменклатурнаяГруппа = СправочникНоменклатурныеГруппы.КантТ Тогда
				
					Кант = ЭлементЗаписи.ПодставляемаяНоменклатура;
					
				ИначеЕсли НоменклатурнаяГруппа = СправочникНоменклатурныеГруппы.Кромка045_19 Тогда
				
					Кромка045х19мм = ЭлементЗаписи.ПодставляемаяНоменклатура;
					
				ИначеЕсли НоменклатурнаяГруппа = СправочникНоменклатурныеГруппы.Кромка2_19 Тогда
				
					Кромка2х19мм = ЭлементЗаписи.ПодставляемаяНоменклатура;
					
				ИначеЕсли НоменклатурнаяГруппа = СправочникНоменклатурныеГруппы.Кромка2_35 Тогда
				
					Кромка2х35мм = ЭлементЗаписи.ПодставляемаяНоменклатура;
					
				ИначеЕсли НоменклатурнаяГруппа = СправочникНоменклатурныеГруппы.МонтажныйУголок Тогда
				
					МонтажныйУголок = ЭлементЗаписи.ПодставляемаяНоменклатура;
					
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры
